/*
 * ПАТТЕРН "СТРОИТЕЛЬ"
 *
 * Пример:
 * -------
 * Пример похожий на пример из 04_Factory. Но цель другая. Как можно инкапсулировать и отдельно отвести процесс создания машины
 * и отдельно процесс принципа ее создания.
 * В этом примере используются два паттерна. Фабрика и Строитель.
 * Класс Car в котором есть 6 свойств - строк, в котором хранится информация о машине.
 *
 *
 * Проблема проектирования:
 * ------------------------
 *
 *
 *
 */

#include <iostream>

using namespace std;

int main()
{
    cout << "Hello World!" << endl;
    return 0;
}
